package org.itstep.qa;

public class Zadanie9 {
    public static void main(String[] args) {
        // Задача 9
        //Имеется двумерный массив, заполненный случайными значениями. Найти максимальный элемент этого массива. Вывести значение элемента, его индексы, а также значения его соседей в обоих  измерениях
        //Пример.
          //      Массив:
        //1   2   4
        //7   9   8
        //4   5   6
        //Вывод на экран должен быть вида:
        //Максимальный элемент 9
        //Индексы: i = 1; j = 1
        //Значения соседей: 2, 7, 8, 5
        // ыдловаждыоа

    }
}
